#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_ecr_repository.tune-train: Refreshing state... [id=tune-train-repo-prod]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-013f184cf808d1fec]
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-0b3016976940854f2]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0a9b01dbf682872c0]
data.aws_iam_policy_document.ecs_agent: Reading...
data.aws_ami.aws_optimized_ecs: Reading...
data.aws_iam_policy_document.ecs_agent: Read complete after 0s [id=320642683]
data.aws_ami.aws_optimized_ecs: Read complete after 0s [id=ami-0f8d9a31a1b32f6a1]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0ea245a5ca73c036b]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0c05c4efc4c3615c3]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-08a4a4e9ec1ac9f28]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-08e8fc4b8d38d5795]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-054e0d96b0912fb00]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-064c2c8470161976a]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-029791e1bc4fde651]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0bbaec7f03bf0091d]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-08e8fc4b8d38d57951080289494]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0960db45de59ec722]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-09450d865c9517673]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-073df7f6822d3c460]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-07a3eb097ed77657e]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0403692fc92e811c9]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-02ffd3022b3c4fe94]
aws_db_subnet_group.tune-train-db-subnet-group: Refreshing state... [id=tune-train-db-subnet-group]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0ea245a5ca73c036b1080289494]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-054e0d96b0912fb001080289494]
aws_db_instance.tune-train: Refreshing state... [id=tune-train-prod]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_autoscaling_group.tune-train-asg will be created
  + resource "aws_autoscaling_group" "tune-train-asg" {
      + arn                       = (known after apply)
      + availability_zones        = (known after apply)
      + default_cooldown          = 30
      + desired_capacity          = (known after apply)
      + force_delete              = false
      + force_delete_warm_pool    = false
      + health_check_grace_period = 30
      + health_check_type         = (known after apply)
      + id                        = (known after apply)
      + launch_configuration      = "tune-train"
      + max_size                  = 2
      + metrics_granularity       = "1Minute"
      + min_size                  = 1
      + name                      = (known after apply)
      + name_prefix               = "tune-train"
      + protect_from_scale_in     = false
      + service_linked_role_arn   = (known after apply)
      + termination_policies      = [
          + "OldestInstance",
        ]
      + vpc_zone_identifier       = [
          + "vpc-013f184cf808d1fec",
        ]
      + wait_for_capacity_timeout = "10m"
    }

  # aws_cloudwatch_log_group.log-group will be created
  + resource "aws_cloudwatch_log_group" "log-group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "tune-train-prod-logs"
      + retention_in_days = 0
      + tags              = {
          + "managedBy" = "terraform"
          + "service"   = "tune-train"
          + "stage"     = "prod"
        }
      + tags_all          = {
          + "managedBy" = "terraform"
          + "service"   = "tune-train"
          + "stage"     = "prod"
        }
    }

  # aws_ecs_cluster.aws-ecs-cluster will be created
  + resource "aws_ecs_cluster" "aws-ecs-cluster" {
      + arn                = (known after apply)
      + capacity_providers = (known after apply)
      + id                 = (known after apply)
      + name               = "tune-train-prod-cluster"
      + tags               = {
          + "managedBy" = "terraform"
          + "service"   = "tune-train"
          + "stage"     = "prod"
        }
      + tags_all           = {
          + "managedBy" = "terraform"
          + "service"   = "tune-train"
          + "stage"     = "prod"
        }

      + default_capacity_provider_strategy {
          + base              = (known after apply)
          + capacity_provider = (known after apply)
          + weight            = (known after apply)
        }

      + setting {
          + name  = (known after apply)
          + value = (known after apply)
        }
    }

  # aws_iam_instance_profile.ecs_agent will be created
  + resource "aws_iam_instance_profile" "ecs_agent" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "ecs-agent"
      + path        = "/"
      + role        = "tune-train-execution-task-role"
      + tags_all    = (known after apply)
      + unique_id   = (known after apply)
    }

  # aws_iam_role.ecs_agent will be created
  + resource "aws_iam_role" "ecs_agent" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "tune-train-execution-task-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "managedBy" = "terraform"
          + "service"   = "tune-train"
          + "stage"     = "prod"
        }
      + tags_all              = {
          + "managedBy" = "terraform"
          + "service"   = "tune-train"
          + "stage"     = "prod"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role_policy_attachment.ecs_agent will be created
  + resource "aws_iam_role_policy_attachment" "ecs_agent" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonEC2ContainerServiceforEC2Role"
      + role       = "tune-train-execution-task-role"
    }

  # aws_launch_configuration.tune-train-launch-config will be created
  + resource "aws_launch_configuration" "tune-train-launch-config" {
      + arn                         = (known after apply)
      + associate_public_ip_address = (known after apply)
      + ebs_optimized               = (known after apply)
      + enable_monitoring           = true
      + iam_instance_profile        = (known after apply)
      + id                          = (known after apply)
      + image_id                    = "ami-0f8d9a31a1b32f6a1"
      + instance_type               = "t2.micro"
      + key_name                    = (known after apply)
      + name                        = (known after apply)
      + name_prefix                 = "tune-train"
      + user_data                   = "9bb19dba7751b9c5e22b242529a41c12a9ef11f3"

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + no_device             = (known after apply)
          + snapshot_id           = (known after apply)
          + throughput            = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + throughput            = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

Plan: 7 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @ericvtheg, Action: `pull_request`, Working Directory: ``, Workflow: `Deploy Infrastructure & Container`*